src/DataProcessors/табАид_ВиртуальныйМенеджер/табАид_ВиртуальныйМенеджер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>табАид_ВиртуальныйМенеджер</name>
  <attributes>
    <name>ДатаОтчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантКлассификации</name>
    <type>
      <types>CatalogRef.ВариантыКлассификацииЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/табАид_ПравилаФормированияСобытий/табАид_ПравилаФормированияСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>табАид_ПравилаФормированияСобытий</name>
  <resources>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалСообщений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПовторов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчитыватьЧасовойПояс</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонСообщения</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </resources>
  <resources>
    <name>РазовоеУведомление</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаНачалаСобытияУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.табАид_ВидыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусПартнера</name>
    <type>
      <types>CatalogRef.табАид_СтатусыПартнеров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.табАид_ТипыСообщений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДеньНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КоличествоДнейЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючПравила</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДетализироватьПоОбъектамРасчетов</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ОтчетКомиссионераОСписании</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ВыкупВозвратнойТарыКлиентом</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/табАид_ВиртуальныйМенеджер/Forms/ФормаУдаленияПравил/Module.bsl
&НаКлиенте
Процедура СписокПравилВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение,"Выбраная строка будет удалена вместе с регламентными заданиями. Продолжить?", Режим, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	МассивКлючей = Новый Массив;
	Стр = Элементы.СписокПравил.ТекущиеДанные;
	Если Стр <> Неопределено Тогда
		 УдалитьНаСервере(Элементы.СписокПравил.ТекущиеДанные.КлючПравила);
	КонецЕсли;
	
	Элементы.СписокПравил.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура  УдалитьНаСервере(Ключ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	табАид_ПравилаФормированияСобытий.КлючРегламентногоЗадания КАК КлючРегламентногоЗадания,
	               |	табАид_ПравилаФормированияСобытий.КлючПравила КАК КлючПравила
	               |ИЗ
	               |	РегистрСведений.табАид_ПравилаФормированияСобытий КАК табАид_ПравилаФормированияСобытий
	               |ГДЕ
	               |	табАид_ПравилаФормированияСобытий.КлючПравила = &КлючПравила";
	Запрос.УстановитьПараметр("КлючПравила",Ключ);
	Результат = Запрос.Выполнить().Выгрузить();
	Масс = Результат.ВыгрузитьКолонку("КлючРегламентногоЗадания");
	
	табАид_ОбщегоНазначенияПереопределяемый.УдалениеРегламентныхЗаданийТАБАИД(Масс);
	
	табАид_ОбщегоНазначенияПереопределяемый.УдалениеСпискаСообщенийТАБАИД(Результат);
	
	табАид_ОбщегоНазначенияПереопределяемый.УдалениеПравилФормированияСобытийТАБАИД(Результат);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение,"Выбраная строка будет удалена вместе с регламентными заданиями. Продолжить?", Режим, 0);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		 
	Если Параметры.Свойство("ДополнительныеПараметры") и ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Структура") тогда
		ГруппаОтбора = СписокПравил.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора =  ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		// ЭлементОтбора.Родитель = ГруппаОтбора;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КлючПравила");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Параметры.ДополнительныеПараметры.СписокПравил;
		
		ЭлементОтбора =  ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		// ЭлементОтбора.Родитель = ГруппаОтбора;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеньНедели");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = Параметры.ДополнительныеПараметры.ДеньНедели;
		
	КонецЕсли;

КонецПроцедуры
